[
    {
        "_id" : "spotify_ar_Id_artist1",
        "singerData" : {
            "name" : "Justin Bieber",
            "isVerified" : true,
            "images" : {
                "profileImage" : "https://i.scdn.co/image/ab6761610000e5eb8ae7f2aaa9817a704a87ea36",
                "bannerImage" : "https://i.scdn.co/image/ab6761610000e5eb8ae7f2aaa9817a704a87ea36",
                "shortImage" : "url"
            },
            "montlyListner" : 73352160
        },
        "singerAbout" : {
            "images" : [
                "url",
                "url",
                "url"
            ],
            "discription" : "Justin's recent album JUSTICE includes the chart-topping global smashes \"Peaches feat. Daniel Caesar & Giveon\", “Holy” feat. Chance The Rapper, “Lonely” feat. Benny Blanco, “Anyone,” and “Hold On.\" The album also features guest appearances from The Kid LAROI, Dominic Fike, Khalid, Beam, Burna Boy, Lil Uzi Vert, Jaden, Quavo + more. The JUSTICE campaign has reasserted Justin’s dominance as a live performer; from his triumphant return to the live stage with his T-Mobile-sponsored NYE livestream concert, to his record breaking TikTok performance “Journals Live” to his stunning AR-assisted performance for Spotify, to his epic Nickelodeon Kids' Choice Awards set and this week’s blockbuster NPR Tiny Desk Concert, Justin has delivered undeniable, show stopping performances. Along the way, Justin has appeared as musical guest twice on Saturday Night Live, performed on The American Music Awards, The People’s Choice Awards, and much more. With over 86 billion career streams and over 78 million albums sold worldwide, Justin Bieber continues to reign as one of the biggest artists in the world. Bieber is the #1 artist on Spotify with over 75 million monthly listeners!",
            "rankInWork" : 7,
            "totalFollowers" : 72011316,
            "socialLinks" : [
                {
                    "linkUrl" : "url",
                    "linkName" : "Instagram",
                    "linkCode" : "social_insta"
                },
                {
                    "linkUrl" : "url",
                    "linkName" : "Facebook",
                    "linkCode" : "social_face"
                },
                {
                    "linkUrl" : "url",
                    "linkName" : "Twitter",
                    "linkCode" : "social_twit"
                },
                {
                    "linkUrl" : "url",
                    "linkName" : "Wikipedia",
                    "linkCode" : "social_wiki"
                }
            ]
        },
        "singerAlbum" : [
            {
                "albumName" : "Name",
                "albumThumbnail" : "URL",
                "songs" : [
                    "Song_Id"
                ]
            }
        ],
        "singerPlaylist" : [
            {
                "playlistName" : "Name",
                "playlistThumbnail" : "URL",
                "songs" : [
                    "Song_Id"
                ]
            }
        ]
    }
]